'use script'
// Дан следующий массив:
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];

// Выведите с его помощью элементы с текстом 'l', 'e', 'g' и 'a'. 
// let arr = [
// 	['a', 'b', 'c'],
// 	['d', 'e', 'f'],
// 	['g', 'h', 'i'],
// 	['j', 'k', 'l'],
// ];
// console.log(arr[3][2] , arr[1][1] , arr[2][0] , arr[0][0] );

//  Дан следующий массив:
// let arr = [[1, 2], [3, 4], [5, 6]];

// Обращаясь к каждому элементу массива найдите сумму всех его элементов. 

// let arr = [[1, 2], [3, 4], [5, 6]];
// let sum = 0 ;
// for( let i = 0 ; i < arr.length ;i ++){


//     for ( let k = 0 ; k < arr[i].length ; k ++){

//      sum += arr[i][k]
//     }
// }

// console.log(sum);

//  Дан следующий массив:
// let arr = [
// 	[
// 		[1, 2],
// 		[3, 4],
// 	],
// 	[
// 		[5, 6],
// 		[7, 8],
// 	],
// ];

// Обращаясь к каждому элементу массива найдите сумму всех его элементов. 

// let arr = [
// 	[
// 		[1, 2],
// 		[3, 4],
// 	],
// 	[
// 		[5, 6],
// 		[7, 8],
// 	],
// ];
// let sum = 0 ;
// for ( let i = 0 ; i < arr.length ; i ++ ){
//     for (let j = 0 ; j < arr[i].length ; j ++){
//          for ( let k = 0 ; k < arr[i][j].length ; k ++){
//             sum += arr[i][j][k] ;
//          }

//     }
// }
// console.log(sum);

//  Дан следующий массив:
// let arr = [[1, 2, 3, [4, 5, [6, 7]]], [8, [9, 10]]];

// Вручную, без цикла, найдите сумму элементов этого массива. 

// let arr = [[1, 2, 3, [4, 5, [6, 7]]], [8, [9, 10]]];
// let sum = arr[0][0] + arr[0][1] + arr[0][2] + arr[0][3][0]
//  + arr[0][3][1] + arr[0][3][2][0] + arr[0][3][2][1]+ arr[1][0] + arr[1][1][0] + arr[1][1][1]

// console.log(sum);

//  Дан двухмерный массив с числами:
// let arr = [[1, 2, 3], [4, 5], [6]];

// С помощью вложенных циклов найдите сумму элементов этого массива. 
// let arr = [[1, 2, 3], [4, 5], [6]];
// let sum = 0 ;

// for ( let el of arr){
//     for (let el2 of el ){
//         sum += el2 ;
//     }
// }
// console.log(sum);

//  Дан трехмерный массив с числами:
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];

// С помощью вложенных циклов найдите сумму элементов этого массива. 
// let arr = [[[1, 2], [3, 4]], [[5, 6], [7, 8]]];
// let sum = 0 ;
// for (let elem1 of arr){
//     for ( let elem2 of elem1){
//         for ( elem3 of elem2){
//             sum +=  elem3
//         }
//     }
// }
// console.log(sum);

//  Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2, 3, 4, 5], [1, 2, 3, 4, 5], [1, 2, 3, 4, 5]]
// let arr = [] ;
// for ( let i = 0 ; i <= 2 ; i++){
//     arr [i] = [] ;
//     for ( let k = 1 ; k <= 5 ; k ++ ){
//         arr[i].push(k)
//     }
// }
// console.log(arr);

// Сформируйте с помощью двух вложенных циклов следующий массив:
// [['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x'], ['x', 'x', 'x', 'x']]
// let arr = [] ;
// for ( let i = 0 ; i <= 2 ; i++){
//     let str = 'x'
//     arr [i] = [] ;
//     for ( let k = 1 ; k <= 4 ; k ++ ){
//         arr[i].push(str)
//     }
// }
// console.log(arr);

//  Сформируйте с помощью трех вложенных циклов следующий массив:
// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]

// let arr = [] ; 
// for ( let i = 0 ; i <= 2 ;  i ++){
//     arr[i] = [];
//     for ( let j = 0 ; j <= 1 ; j ++){
//         arr[i][j] = []; 
//         for ( let k = 1 ; k <= 5 ; k++){
//             arr[i][j].push(k) 
//         }
//     }
// }
// console.log(arr);

//  Сформируйте с помощью двух вложенных циклов следующий массив:
// [[1, 2], [3, 4], [5, 6], [7, 8]]
// let arr = [] ;
// let k = 1 ;
// for (let i = 0 ; i <= 3 ; i++){
//     arr[i] = [];
//     for ( let j = 0 ; j <= 1 ; j ++){
//         arr[i].push(k) ;
//         k ++ ;
//     }
// }
// console.log(arr);

//  Сформируйте с помощью двух вложенных циклов следующий массив:
// [[2, 4, 6], [8, 10, 12], [14, 16, 18], [20, 22, 24]]

// let arr = [] ;
// let k = 2 ;
// for (let i = 0 ; i <= 3 ; i++){
//     arr[i] = [];
//     for ( let j = 0 ; j <= 2 ; j ++){
//         arr[i].push(k) ;
//         k += 2  ;
//     }
// }
// console.log(arr);

//  Сформируйте с помощью трех вложенных циклов следующий трехмерный массив:
// [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]
// let arr = [];
// let d = 1 ;
// for (let i = 0 ; i <= 1 ; i ++){
//     arr[i] = [] ;
//     for ( let j = 0 ; j <=1 ; j ++){
//         arr[i][j] = []
//         for ( let k = 0 ; k <= 1 ; k ++){
//             arr[i][j].push(d) ;
//             d ++ ;
//         }

//     }
// } 
// console.log(arr);

